УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромInstagramDirect/CRM_РаботаСМессенджеромInstagramDirect.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РаботаСМессенджеромInstagramDirect</name>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/Documents/CRM_СообщениеМессенджера/CRM_СообщениеМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_СообщениеМессенджера</name>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_Сообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромInstagramDirect/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбязательныеМетодыПрограмногоИнтерфейса

Функция ПолучитьСообщения(УчетнаяЗапись) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СообщениеМессенджера.ID_Пользователя КАК ID_Пользователя,
	                      |	МАКСИМУМ(CRM_СообщениеМессенджера.Дата) КАК Дата
	                      |ПОМЕСТИТЬ ПоДатам
	                      |ИЗ
	                      |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |ГДЕ
	                      |	CRM_СообщениеМессенджера.УчетнаяЗапись = &УчетнаяЗапись
	                      |	И CRM_СообщениеМессенджера.Группа = &Группа
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_СообщениеМессенджера.ID_Пользователя
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПоДатам.ID_Пользователя КАК ID_Пользователя,
	                      |	ПоДатам.Дата КАК Дата,
	                      |	CRM_СообщениеМессенджера.ID_Сообщения КАК ID_Сообщения
	                      |ИЗ
	                      |	ПоДатам КАК ПоДатам
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |		ПО ПоДатам.ID_Пользователя = CRM_СообщениеМессенджера.ID_Пользователя
	                      |			И ПоДатам.Дата = CRM_СообщениеМессенджера.Дата");
	Запрос.УстановитьПараметр("Группа", СтруктураПараметровДоступа.IDГруппы);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	МассивРезультатов = Запрос.Выполнить().Выгрузить();
	Ресурс = "/v10.0/me/conversations/?platform=instagram&fields=id,senders,messages.limit(100){message,created_time,attachments,tags,from,story}&access_token="
		+ СтруктураПараметровДоступа.ТокенГруппы;
	
	МассивСообщений = Новый Массив;
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("graph.facebook.com",
		 "", Ресурс,
		 СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error.message;
	Иначе
		Для каждого Диалог из СтруктураОтвета.data Цикл
			Для каждого ТекСообщение из Диалог.messages.data Цикл
				Если ТекСообщение.from.id <> СтруктураПараметровДоступа.IDГруппы Тогда
					ID_Пользователя = ТекСообщение.from.id;
					username = ТекСообщение.from.username;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			СтрокаСПоследнимСообщением = МассивРезультатов.Найти(ID_Пользователя, "ID_Пользователя");
			ПоследнийID = "";
			Если СтрокаСПоследнимСообщением <> Неопределено Тогда
				МаксДата = СтрокаСПоследнимСообщением.Дата;
				ПоследнийID = СтрокаСПоследнимСообщением.ID_Сообщения;
			Иначе
				МаксДата = Дата(1, 1, 1);
			КонецЕсли;
			Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации("https://www.instagram.com/" 
				+ username, УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
			Для каждого ТекСообщение из Диалог.messages.data Цикл
				Если ПоследнийID = ТекСообщение.id Тогда
					Прервать;
				КонецЕсли;
				Дата = ДатаИзСтроки(ТекСообщение.created_time);
				Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
				Сообщение.Дата = Дата;
				Сообщение.ID_Сообщения = ТекСообщение.id;
				Сообщение.ТекстСообщения = ТекСообщение.message;
				Если ТекСообщение.Свойство("story") Тогда
					Если ТекСообщение["story"].Свойство("reply_to") Тогда
						Сообщение.ТекстСообщения = "Ответил(-а) на вашу историю" + Символы.ПС + Сообщение.ТекстСообщения;
						Сообщение.ТекстHTML = "<span style='font-size: 9pt;color: #838E9C;'>Ответил(-а) на вашу <a href=" 
							+ ТекСообщение.story.reply_to.link + ">историю</a></span><br/><span>" + ТекСообщение.message 
							+ "</span>";
					ИначеЕсли ТекСообщение["story"].Свойство("mention") Тогда
						// АПК:1223-выкл  отключаем проверку на использование местоимений "Вы", "Вас" и пр.
						Сообщение.ТекстСообщения = "Упомянул(-а) вас в своей истории";
						Сообщение.ТекстHTML = "<span style='font-size: 9pt;color: #838E9C;'>Упомянул(-а) вас в своей <a href=" 
							+ ТекСообщение.story.mention.link 
							+ ">истории</a></span>";
						// АПК:1223-вкл
					КонецЕсли;
				КонецЕсли;		
				Сообщение.ВидСообщения = "Входящее";
				Если ТекСообщение.from.id = СтруктураПараметровДоступа.IDГруппы Тогда
					Сообщение.ВидСообщения = "Исходящее";
				КонецЕсли;		
				Сообщение.ID_Пользователя = ID_Пользователя;
				Если ЗначениеЗаполнено(Контакт) Тогда
					Сообщение.Контакт = Контакт;
				КонецЕсли;
				Сообщение.КонтактПредставление = username;
				Сообщение.Группа = СтруктураПараметровДоступа.IDГруппы;
				
				Если ТекСообщение.Свойство("attachments") Тогда
					КаталогВременныхФайлов = КаталогВременныхФайлов();
					Для каждого Вложение из ТекСообщение.attachments.data Цикл
						Если Вложение.Свойство("image_data") Тогда
							ПутьКФайлу = Вложение.image_data.url;
						Иначе
							ПутьКФайлу = Вложение.file_url;
						КонецЕсли;
						ТретийСлеш = СтрНайти(ПутьКФайлу, "/", , , 3);
						Если ТретийСлеш > 0 Тогда
							Соединение = Новый HTTPСоединение(СтрЗаменить(Лев(ПутьКФайлу, ТретийСлеш - 1), "https://",
								 ""), , , , , 20,
								 Новый ЗащищенноеСоединениеOpenSSL);
							Ответ = Соединение.Получить(Сред(ПутьКФайлу, ТретийСлеш + 1));
							Заголовок = Ответ.Заголовки.Получить("Content-Disposition");
							Если Заголовок = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							ИмяФайла = Сред(Заголовок, СтрНайти(Заголовок, "=") + 1);
							Соединение.Получить(Сред(ПутьКФайлу, ТретийСлеш + 1), КаталогВременныхФайлов + ИмяФайла);
							Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + ИмяФайла);
							АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
							ПараметрыФайла = Новый Структура;
							ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
							ПараметрыФайла.Вставить("Автор", Неопределено);
							ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
							ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
							ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
							ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
							ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
							Сообщение.Вложения.Добавить(ПараметрыФайла);
							Попытка
								УдалитьФайлы(КаталогВременныхФайлов + ИмяФайла);
							Исключение
								ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
									УровеньЖурналаРегистрации.Информация,
									,
									,
									ИнформацияОбОшибке().Описание);
							КонецПопытки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				МассивСообщений.Добавить(Сообщение);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Возврат МассивСообщений;
	
КонецФункции

Функция ДатаИзСтроки(ДатаСтрокой)
	
	Темп = СтрЗаменить(ДатаСтрокой, "-", "");
	Темп = СтрЗаменить(Темп, "T", "");
	Темп = СтрЗаменить(Темп, ":", "");
	Темп = Лев(Темп, 14);
	Возврат МестноеВремя(Дата(Темп));
	
КонецФункции

Функция ОтправитьСообщение(Сообщение, УчетнаяЗапись, IDПользователя, СписокФайлов, ДопПараметры) Экспорт
	
	// +Рарус alexpr
	//Возврат CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ОтправитьСообщениеМессенджера(Сообщение,
	//	 УчетнаяЗапись, IDПользователя, СписокФайлов,
	//	 ДопПараметры);
	Возврат CRM_ЛицензированиеЭкспортныеМетодыНовый.ПолучитьЗащищеннуюОбработку().ОтправитьСообщениеМессенджера(Сообщение,
		 УчетнаяЗапись, IDПользователя, СписокФайлов,
		 ДопПараметры);
	// -Рарус alexpr
	
КонецФункции

Процедура ОжиданиеСобытий(УчетнаяЗапись) Экспорт
	
КонецПроцедуры

Функция ПолучитьВидКИМессенджера(Контакт) Экспорт
	
	Наименование = "Instagram";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	                      |	ВидыКонтактнойИнформации.ПометкаУдаления КАК ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	                      |ГДЕ
	                      |	ВидыКонтактнойИнформации.Наименование = &Наименование
	                      |	И ВидыКонтактнойИнформации.Тип = &Тип
	                      |	И ВидыКонтактнойИнформации.Родитель = &Родитель");
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникCRM_ПотенциальныеКлиенты;
	КонецЕсли;
	
	ТипКИ = ТипКИМессенджера();
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Тип", ТипКИ);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ПометкаУдаления Тогда
			Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйВидКИ.Родитель = Родитель;
		НовыйВидКИ.Наименование = Наименование;
		НовыйВидКИ.Тип = ТипКИ;
		НовыйВидКИ.Используется = Истина;
		НовыйВидКИ.ВидРедактирования = "Диалог";
		НовыйВидКИ.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НовыйВидКИ.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ТипКИМессенджера() Экспорт
	
	Возврат Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	
КонецФункции

Функция НачалоАдресаСтраницыПользователя() Экспорт
	Возврат "https://www.instagram.com/";
КонецФункции

Функция ПутьКДиалогуВБраузере(Структура) Экспорт
	Возврат "https://www.facebook.com/" + Структура.Группа + "/inbox/" + Структура.ID_Пользователя;
КонецФункции

Функция ПредставлениеКонтактнойИнформацииПользователя(ID_Пользователя) Экспорт
	Возврат НачалоАдресаСтраницыПользователя() + ID_Пользователя;
КонецФункции

Функция ВозможноИзменениеСообщений() Экспорт
	Возврат Истина; 
КонецФункции

Функция ИспользуютсяВложения() Экспорт
	Возврат Истина; 
КонецФункции

Функция HTMLКонтекста(УчетнаяЗапись, idПользователя, idГруппы) Экспорт
	Возврат Неопределено; 
КонецФункции

Функция Отключиться(СтруктураПараметровДоступа) Экспорт
	Возврат Истина;
	Токен = СтруктураПараметровДоступа.ТокенГруппы;
	Ресурс = "/v10.0/me/permission?access_token=" + Токен;
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("graph.facebook.com", ,
		Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси, "x-www-form-urlencoded", Истина));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error.message;
	Иначе
		Возврат СтруктураОтвета.success;
	КонецЕсли;
КонецФункции

Процедура ПометитьКакПрочтенные(УчетнаяЗапись, МассивСообщений) Экспорт
	
КонецПроцедуры

Функция ПользовательДоступен(УчетнаяЗапись, ДополнительныеДанные) Экспорт
	
	Возврат Новый Структура("Доступен, Описание", Ложь, "");
	
КонецФункции

Функция ПараметрыМессенджера() Экспорт
	
	ПараметрыМессенджера = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровМессенджера();
	ПараметрыМессенджера.ФильтрВложений = "Все картинки (*.bmp;*.jpg;*.jpeg;*.ico;*.png)|*.bmp;*.jpg;*.jpeg;*.ico;*.png";
	ПараметрыМессенджера.МаксРазмерВложения = 8 * 1024 * 1024;

	Возврат ПараметрыМессенджера;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеМетоды

Функция ПолучитьСписокСтраницПользователя(Токен, ПараметрыПрокси) Экспорт
	Ресурс = "/v10.0/me/accounts?access_token=" + Токен;
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("graph.facebook.com",
		 "", Ресурс,
		 ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураОтвета.error.message);
	Иначе
		Результат = Новый Структура();
		Для Каждого Страница из СтруктураОтвета.data Цикл
			Результат.Вставить("_" + Страница.id, Новый Структура("Имя, Токен", Страница.name, Страница.access_token));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
КонецФункции

Функция ПолучитьТокенСтраницыПользователя(СтраницаID, Токен, КороткийТокен, ПараметрыПрокси) Экспорт
	Возврат КороткийТокен;
	Ресурс = "/v10.0/" + СтраницаID + "/?fields=access_token&account_linking_token=" + КороткийТокен 
		+ "&access_token=" 
		+ Токен;
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("graph.facebook.com",
		 "", Ресурс,
		 ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураОтвета.error.message);
	Иначе
		Возврат СтруктураОтвета.access_token;
	КонецЕсли;
КонецФункции

Функция ДанныеГруппы(Токен, СтраницаID = "", ПараметрыПрокси) Экспорт
	Ресурс = "/v10.0/me/?access_token=" + Токен;
	Если СтраницаID <> "" Тогда
		Ресурс = СтрЗаменить(Ресурс, "me", СтраницаID);
	КонецЕсли;
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("graph.facebook.com",
		 "", Ресурс,
		 ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error.message;
	Иначе
		Возврат СтруктураОтвета.name;
	КонецЕсли;
КонецФункции

Функция ВремяСообщенияНаСервере(УчетнаяЗапись, idСообщения) Экспорт
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ресурс = "/v10.0/" + idСообщения + "/?access_token=" + СтруктураПараметровДоступа.ТокенГруппы;
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("graph.facebook.com",
		 "", Ресурс,
		 СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error.message;
	Иначе
		Возврат ДатаИзСтроки(СтруктураОтвета.created_time);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
